; ModuleID = 'lu.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@omega = common global double 0.000000e+00, align 8
@a = common global [12 x [13 x [5 x [5 x double]]]] zeroinitializer, align 16
@b = common global [12 x [13 x [5 x [5 x double]]]] zeroinitializer, align 16
@c = common global [12 x [13 x [5 x [5 x double]]]] zeroinitializer, align 16
@d = common global [12 x [13 x [5 x [5 x double]]]] zeroinitializer, align 16
@nx0 = common global i32 0, align 4
@ny0 = common global i32 0, align 4
@nz0 = common global i32 0, align 4
@ist = common global i32 0, align 4
@iend = common global i32 0, align 4
@jst = common global i32 0, align 4
@jend = common global i32 0, align 4
@rsd = common global [12 x [13 x [13 x [5 x double]]]] zeroinitializer, align 16
@rsdnm = common global [5 x double] zeroinitializer, align 16
@itmax = common global i32 0, align 4
@.str = private unnamed_addr constant [16 x i8] c" Time step %4d\0A\00", align 1
@timeron = common global i32 0, align 4
@nz = common global i32 0, align 4
@dt = common global double 0.000000e+00, align 8
@nx = common global i32 0, align 4
@ny = common global i32 0, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !11, globals: !126)
!1 = !DIFile(filename: "lu.c", directory: "/home/jingl/trace_analysis_code/trace_analysis_code_lulesh_m_delv_zeta/benchmark_working_station/lu")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 4, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./type.h", directory: "/home/jingl/trace_analysis_code/trace_analysis_code_lulesh_m_delv_zeta/benchmark_working_station/lu")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "false", value: 0)
!7 = !DIEnumerator(name: "true", value: 1)
!8 = !{!9, !10}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!11 = !{!12, !33, !45}
!12 = distinct !DISubprogram(name: "ssor", scope: !1, file: !1, line: 130, type: !13, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true, variables: !16)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !15}
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !30}
!17 = !DILocalVariable(name: "niter", arg: 1, scope: !12, file: !1, line: 130, type: !15)
!18 = !DILocalVariable(name: "i", scope: !12, file: !1, line: 135, type: !15)
!19 = !DILocalVariable(name: "j", scope: !12, file: !1, line: 135, type: !15)
!20 = !DILocalVariable(name: "k", scope: !12, file: !1, line: 135, type: !15)
!21 = !DILocalVariable(name: "m", scope: !12, file: !1, line: 135, type: !15)
!22 = !DILocalVariable(name: "n", scope: !12, file: !1, line: 135, type: !15)
!23 = !DILocalVariable(name: "istep", scope: !12, file: !1, line: 136, type: !15)
!24 = !DILocalVariable(name: "tmp", scope: !12, file: !1, line: 137, type: !10)
!25 = !DILocalVariable(name: "tv", scope: !12, file: !1, line: 137, type: !26)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 46080, align: 64, elements: !27)
!27 = !{!28, !28, !29}
!28 = !DISubrange(count: 12)
!29 = !DISubrange(count: 5)
!30 = !DILocalVariable(name: "delunm", scope: !12, file: !1, line: 138, type: !31)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 320, align: 64, elements: !32)
!32 = !{!29}
!33 = distinct !DISubprogram(name: "orss", scope: !1, file: !1, line: 362, type: !13, isLocal: false, isDefinition: true, scopeLine: 363, flags: DIFlagPrototyped, isOptimized: true, variables: !34)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!35 = !DILocalVariable(name: "niter", arg: 1, scope: !33, file: !1, line: 362, type: !15)
!36 = !DILocalVariable(name: "i", scope: !33, file: !1, line: 367, type: !15)
!37 = !DILocalVariable(name: "j", scope: !33, file: !1, line: 367, type: !15)
!38 = !DILocalVariable(name: "k", scope: !33, file: !1, line: 367, type: !15)
!39 = !DILocalVariable(name: "m", scope: !33, file: !1, line: 367, type: !15)
!40 = !DILocalVariable(name: "n", scope: !33, file: !1, line: 367, type: !15)
!41 = !DILocalVariable(name: "istep", scope: !33, file: !1, line: 368, type: !15)
!42 = !DILocalVariable(name: "tmp", scope: !33, file: !1, line: 369, type: !10)
!43 = !DILocalVariable(name: "tv", scope: !33, file: !1, line: 369, type: !26)
!44 = !DILocalVariable(name: "delunm", scope: !33, file: !1, line: 370, type: !31)
!45 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 596, type: !46, isLocal: false, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: true, variables: !51)
!46 = !DISubroutineType(types: !47)
!47 = !{!15, !15, !48}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!51 = !{!52, !53, !54, !55, !57, !58, !59, !60, !63, !64, !66}
!52 = !DILocalVariable(name: "argc", arg: 1, scope: !45, file: !1, line: 596, type: !15)
!53 = !DILocalVariable(name: "argv", arg: 2, scope: !45, file: !1, line: 596, type: !48)
!54 = !DILocalVariable(name: "Class", scope: !45, file: !1, line: 598, type: !50)
!55 = !DILocalVariable(name: "verified", scope: !45, file: !1, line: 599, type: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "logical", file: !4, line: 4, baseType: !3)
!57 = !DILocalVariable(name: "mflops", scope: !45, file: !1, line: 600, type: !10)
!58 = !DILocalVariable(name: "t", scope: !45, file: !1, line: 602, type: !10)
!59 = !DILocalVariable(name: "tmax", scope: !45, file: !1, line: 602, type: !10)
!60 = !DILocalVariable(name: "trecs", scope: !45, file: !1, line: 602, type: !61)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 768, align: 64, elements: !62)
!62 = !{!28}
!63 = !DILocalVariable(name: "i", scope: !45, file: !1, line: 603, type: !15)
!64 = !DILocalVariable(name: "t_names", scope: !45, file: !1, line: 604, type: !65)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 768, align: 64, elements: !62)
!66 = !DILocalVariable(name: "fp", scope: !45, file: !1, line: 609, type: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !69, line: 48, baseType: !70)
!69 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/jingl/trace_analysis_code/trace_analysis_code_lulesh_m_delv_zeta/benchmark_working_station/lu")
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !71, line: 245, size: 1728, align: 64, elements: !72)
!71 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/jingl/trace_analysis_code/trace_analysis_code_lulesh_m_delv_zeta/benchmark_working_station/lu")
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !93, !94, !95, !96, !100, !102, !104, !108, !111, !113, !114, !115, !116, !117, !121, !122}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !70, file: !71, line: 246, baseType: !15, size: 32, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !70, file: !71, line: 251, baseType: !49, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !70, file: !71, line: 252, baseType: !49, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !70, file: !71, line: 253, baseType: !49, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !70, file: !71, line: 254, baseType: !49, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !70, file: !71, line: 255, baseType: !49, size: 64, align: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !70, file: !71, line: 256, baseType: !49, size: 64, align: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !70, file: !71, line: 257, baseType: !49, size: 64, align: 64, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !70, file: !71, line: 258, baseType: !49, size: 64, align: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !70, file: !71, line: 260, baseType: !49, size: 64, align: 64, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !70, file: !71, line: 261, baseType: !49, size: 64, align: 64, offset: 640)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !70, file: !71, line: 262, baseType: !49, size: 64, align: 64, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !70, file: !71, line: 264, baseType: !86, size: 64, align: 64, offset: 768)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !71, line: 160, size: 192, align: 64, elements: !88)
!88 = !{!89, !90, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !87, file: !71, line: 161, baseType: !86, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !87, file: !71, line: 162, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !87, file: !71, line: 166, baseType: !15, size: 32, align: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !70, file: !71, line: 266, baseType: !91, size: 64, align: 64, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !70, file: !71, line: 268, baseType: !15, size: 32, align: 32, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !70, file: !71, line: 272, baseType: !15, size: 32, align: 32, offset: 928)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !70, file: !71, line: 274, baseType: !97, size: 64, align: 64, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !98, line: 131, baseType: !99)
!98 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/jingl/trace_analysis_code/trace_analysis_code_lulesh_m_delv_zeta/benchmark_working_station/lu")
!99 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !70, file: !71, line: 278, baseType: !101, size: 16, align: 16, offset: 1024)
!101 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !70, file: !71, line: 279, baseType: !103, size: 8, align: 8, offset: 1040)
!103 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !70, file: !71, line: 280, baseType: !105, size: 8, align: 8, offset: 1048)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !70, file: !71, line: 284, baseType: !109, size: 64, align: 64, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !71, line: 154, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !70, file: !71, line: 293, baseType: !112, size: 64, align: 64, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !98, line: 132, baseType: !99)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !70, file: !71, line: 302, baseType: !9, size: 64, align: 64, offset: 1216)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !70, file: !71, line: 303, baseType: !9, size: 64, align: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !70, file: !71, line: 304, baseType: !9, size: 64, align: 64, offset: 1344)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !70, file: !71, line: 305, baseType: !9, size: 64, align: 64, offset: 1408)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !70, file: !71, line: 306, baseType: !118, size: 64, align: 64, offset: 1472)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !119, line: 62, baseType: !120)
!119 = !DIFile(filename: "/opt/pasa_lib/llvm-3.8.0/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/jingl/trace_analysis_code/trace_analysis_code_lulesh_m_delv_zeta/benchmark_working_station/lu")
!120 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !70, file: !71, line: 308, baseType: !15, size: 32, align: 32, offset: 1536)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !70, file: !71, line: 310, baseType: !123, size: 160, align: 8, offset: 1568)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 160, align: 8, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 20)
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !175, !176, !177, !180, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !198, !199, !200, !201, !204, !205}
!127 = !DIGlobalVariable(name: "dxi", scope: !0, file: !1, line: 58, type: !10, isLocal: false, isDefinition: true, variable: double* @dxi)
!128 = !DIGlobalVariable(name: "deta", scope: !0, file: !1, line: 58, type: !10, isLocal: false, isDefinition: true, variable: double* @deta)
!129 = !DIGlobalVariable(name: "dzeta", scope: !0, file: !1, line: 58, type: !10, isLocal: false, isDefinition: true, variable: double* @dzeta)
!130 = !DIGlobalVariable(name: "tx1", scope: !0, file: !1, line: 59, type: !10, isLocal: false, isDefinition: true, variable: double* @tx1)
!131 = !DIGlobalVariable(name: "tx2", scope: !0, file: !1, line: 59, type: !10, isLocal: false, isDefinition: true, variable: double* @tx2)
!132 = !DIGlobalVariable(name: "tx3", scope: !0, file: !1, line: 59, type: !10, isLocal: false, isDefinition: true, variable: double* @tx3)
!133 = !DIGlobalVariable(name: "ty1", scope: !0, file: !1, line: 60, type: !10, isLocal: false, isDefinition: true, variable: double* @ty1)
!134 = !DIGlobalVariable(name: "ty2", scope: !0, file: !1, line: 60, type: !10, isLocal: false, isDefinition: true, variable: double* @ty2)
!135 = !DIGlobalVariable(name: "ty3", scope: !0, file: !1, line: 60, type: !10, isLocal: false, isDefinition: true, variable: double* @ty3)
!136 = !DIGlobalVariable(name: "tz1", scope: !0, file: !1, line: 61, type: !10, isLocal: false, isDefinition: true, variable: double* @tz1)
!137 = !DIGlobalVariable(name: "tz2", scope: !0, file: !1, line: 61, type: !10, isLocal: false, isDefinition: true, variable: double* @tz2)
!138 = !DIGlobalVariable(name: "tz3", scope: !0, file: !1, line: 61, type: !10, isLocal: false, isDefinition: true, variable: double* @tz3)
!139 = !DIGlobalVariable(name: "nx", scope: !0, file: !1, line: 62, type: !15, isLocal: false, isDefinition: true, variable: i32* @nx)
!140 = !DIGlobalVariable(name: "ny", scope: !0, file: !1, line: 62, type: !15, isLocal: false, isDefinition: true, variable: i32* @ny)
!141 = !DIGlobalVariable(name: "nz", scope: !0, file: !1, line: 62, type: !15, isLocal: false, isDefinition: true, variable: i32* @nz)
!142 = !DIGlobalVariable(name: "nx0", scope: !0, file: !1, line: 63, type: !15, isLocal: false, isDefinition: true, variable: i32* @nx0)
!143 = !DIGlobalVariable(name: "ny0", scope: !0, file: !1, line: 63, type: !15, isLocal: false, isDefinition: true, variable: i32* @ny0)
!144 = !DIGlobalVariable(name: "nz0", scope: !0, file: !1, line: 63, type: !15, isLocal: false, isDefinition: true, variable: i32* @nz0)
!145 = !DIGlobalVariable(name: "ist", scope: !0, file: !1, line: 64, type: !15, isLocal: false, isDefinition: true, variable: i32* @ist)
!146 = !DIGlobalVariable(name: "iend", scope: !0, file: !1, line: 64, type: !15, isLocal: false, isDefinition: true, variable: i32* @iend)
!147 = !DIGlobalVariable(name: "jst", scope: !0, file: !1, line: 65, type: !15, isLocal: false, isDefinition: true, variable: i32* @jst)
!148 = !DIGlobalVariable(name: "jend", scope: !0, file: !1, line: 65, type: !15, isLocal: false, isDefinition: true, variable: i32* @jend)
!149 = !DIGlobalVariable(name: "ii1", scope: !0, file: !1, line: 66, type: !15, isLocal: false, isDefinition: true, variable: i32* @ii1)
