; ModuleID = 'kmeans.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [259 x i8] c"Usage: %s [switches] -i filename\0A       -i filename     :  file containing data to be clustered\0A       -b                 :input file is in binary format\0A       -k                 : number of clusters (default is 8) \0A       -t threshold    : threshold value\0A\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [8 x i8] c"i:k:t:b\00", align 1
@optarg = external global i8*, align 8
@.str.2 = private unnamed_addr constant [5 x i8] c"0600\00", align 1
@.str.3 = private unnamed_addr constant [26 x i8] c"Error: no such file (%s)\0A\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.5 = private unnamed_addr constant [4 x i8] c" \09\0A\00", align 1
@.str.6 = private unnamed_addr constant [5 x i8] c" ,\09\0A\00", align 1
@.str.7 = private unnamed_addr constant [15 x i8] c"I/O completed\0A\00", align 1
@.str.8 = private unnamed_addr constant [23 x i8] c"number of Clusters %d\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !8)
!1 = !DIFile(filename: "kmeans.c", directory: "/home/azguolu/ARAT-0.1/benchmark_working_station/kmeans")
!2 = !{}
!3 = !{!4, !6, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!8 = !{!9, !17}
!9 = distinct !DISubprogram(name: "usage", scope: !1, file: !1, line: 85, type: !10, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, variables: !14)
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!14 = !{!15, !16}
!15 = !DILocalVariable(name: "argv0", arg: 1, scope: !9, file: !1, line: 85, type: !12)
!16 = !DILocalVariable(name: "help", scope: !9, file: !1, line: 86, type: !12)
!17 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 97, type: !18, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, variables: !22)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !20, !21}
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !39, !40, !41, !42, !44, !47}
!23 = !DILocalVariable(name: "argc", arg: 1, scope: !17, file: !1, line: 97, type: !20)
!24 = !DILocalVariable(name: "argv", arg: 2, scope: !17, file: !1, line: 97, type: !21)
!25 = !DILocalVariable(name: "opt", scope: !17, file: !1, line: 98, type: !20)
!26 = !DILocalVariable(name: "nclusters", scope: !17, file: !1, line: 101, type: !20)
!27 = !DILocalVariable(name: "filename", scope: !17, file: !1, line: 102, type: !12)
!28 = !DILocalVariable(name: "buf", scope: !17, file: !1, line: 103, type: !4)
!29 = !DILocalVariable(name: "attributes", scope: !17, file: !1, line: 104, type: !6)
!30 = !DILocalVariable(name: "cluster_centres", scope: !17, file: !1, line: 105, type: !6)
!31 = !DILocalVariable(name: "i", scope: !17, file: !1, line: 106, type: !20)
!32 = !DILocalVariable(name: "j", scope: !17, file: !1, line: 106, type: !20)
!33 = !DILocalVariable(name: "numAttributes", scope: !17, file: !1, line: 108, type: !20)
!34 = !DILocalVariable(name: "numObjects", scope: !17, file: !1, line: 109, type: !20)
!35 = !DILocalVariable(name: "line", scope: !17, file: !1, line: 110, type: !36)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8192, align: 8, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 1024)
!39 = !DILocalVariable(name: "isBinaryFile", scope: !17, file: !1, line: 111, type: !20)
!40 = !DILocalVariable(name: "nloops", scope: !17, file: !1, line: 112, type: !20)
!41 = !DILocalVariable(name: "threshold", scope: !17, file: !1, line: 113, type: !5)
!42 = !DILocalVariable(name: "timing", scope: !17, file: !1, line: 114, type: !43)
!43 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!44 = !DILocalVariable(name: "infile", scope: !45, file: !1, line: 142, type: !20)
!45 = distinct !DILexicalBlock(scope: !46, file: !1, line: 141, column: 23)
!46 = distinct !DILexicalBlock(scope: !17, file: !1, line: 141, column: 9)
!47 = !DILocalVariable(name: "infile", scope: !48, file: !1, line: 163, type: !49)
!48 = distinct !DILexicalBlock(scope: !46, file: !1, line: 162, column: 10)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !51, line: 48, baseType: !52)
!51 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/azguolu/ARAT-0.1/benchmark_working_station/kmeans")
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 245, size: 1728, align: 64, elements: !54)
!53 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/azguolu/ARAT-0.1/benchmark_working_station/kmeans")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !75, !76, !77, !78, !82, !84, !86, !90, !93, !95, !96, !97, !98, !99, !103, !104}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !52, file: !53, line: 246, baseType: !20, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !52, file: !53, line: 251, baseType: !12, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !52, file: !53, line: 252, baseType: !12, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !52, file: !53, line: 253, baseType: !12, size: 64, align: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !52, file: !53, line: 254, baseType: !12, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !52, file: !53, line: 255, baseType: !12, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !52, file: !53, line: 256, baseType: !12, size: 64, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !52, file: !53, line: 257, baseType: !12, size: 64, align: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !52, file: !53, line: 258, baseType: !12, size: 64, align: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !52, file: !53, line: 260, baseType: !12, size: 64, align: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !52, file: !53, line: 261, baseType: !12, size: 64, align: 64, offset: 640)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !52, file: !53, line: 262, baseType: !12, size: 64, align: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !52, file: !53, line: 264, baseType: !68, size: 64, align: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !53, line: 160, size: 192, align: 64, elements: !70)
!70 = !{!71, !72, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !69, file: !53, line: 161, baseType: !68, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !69, file: !53, line: 162, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !69, file: !53, line: 166, baseType: !20, size: 32, align: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !52, file: !53, line: 266, baseType: !73, size: 64, align: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !52, file: !53, line: 268, baseType: !20, size: 32, align: 32, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !52, file: !53, line: 272, baseType: !20, size: 32, align: 32, offset: 928)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !52, file: !53, line: 274, baseType: !79, size: 64, align: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !80, line: 131, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/azguolu/ARAT-0.1/benchmark_working_station/kmeans")
!81 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !52, file: !53, line: 278, baseType: !83, size: 16, align: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !52, file: !53, line: 279, baseType: !85, size: 8, align: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !52, file: !53, line: 280, baseType: !87, size: 8, align: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !52, file: !53, line: 284, baseType: !91, size: 64, align: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !53, line: 154, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !52, file: !53, line: 293, baseType: !94, size: 64, align: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !80, line: 132, baseType: !81)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !52, file: !53, line: 302, baseType: !7, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !52, file: !53, line: 303, baseType: !7, size: 64, align: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !52, file: !53, line: 304, baseType: !7, size: 64, align: 64, offset: 1344)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !52, file: !53, line: 305, baseType: !7, size: 64, align: 64, offset: 1408)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !52, file: !53, line: 306, baseType: !100, size: 64, align: 64, offset: 1472)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 62, baseType: !102)
!101 = !DIFile(filename: "/opt/pasa_lib/llvm-3.8.0/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/azguolu/ARAT-0.1/benchmark_working_station/kmeans")
!102 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !52, file: !53, line: 308, baseType: !20, size: 32, align: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !52, file: !53, line: 310, baseType: !105, size: 160, align: 8, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !{i32 2, !"Dwarf Version", i32 4}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{i32 1, !"PIC Level", i32 2}
!111 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!112 = !DIExpression()
!113 = !DILocation(line: 85, column: 18, scope: !9)
!114 = !DILocation(line: 86, column: 11, scope: !9)
!115 = !DILocation(line: 92, column: 13, scope: !9)
!116 = !{!117, !117, i64 0}
!117 = !{!"any pointer", !118, i64 0}
!118 = !{!"omnipotent char", !119, i64 0}
!119 = !{!"Simple C/C++ TBAA"}
!120 = !DILocation(line: 92, column: 5, scope: !9)
!121 = !DILocation(line: 93, column: 5, scope: !9)
!122 = !DILocation(line: 97, column: 14, scope: !17)
!123 = !DILocation(line: 97, column: 27, scope: !17)
!124 = !DILocation(line: 101, column: 20, scope: !17)
!125 = !DILocation(line: 102, column: 20, scope: !17)
!126 = !DILocation(line: 105, column: 12, scope: !17)
!127 = !DILocation(line: 105, column: 20, scope: !17)
!128 = !DILocation(line: 108, column: 12, scope: !17)
!129 = !DILocation(line: 109, column: 12, scope: !17)
!130 = !DILocation(line: 110, column: 12, scope: !17)
!131 = !DILocation(line: 110, column: 20, scope: !17)
!132 = !DILocation(line: 111, column: 20, scope: !17)
!133 = !DILocation(line: 113, column: 20, scope: !17)
!134 = !DILocation(line: 118, column: 2, scope: !17)
!135 = !DILocation(line: 118, column: 15, scope: !136)
!136 = !DILexicalBlockFile(scope: !17, file: !1, discriminator: 1)
!137 = !DILocation(line: 98, column: 20, scope: !17)
!138 = !DILocation(line: 118, column: 2, scope: !136)
!139 = !DILocation(line: 120, column: 32, scope: !140)
!140 = distinct !DILexicalBlock(scope: !141, file: !1, line: 119, column: 22)
!141 = distinct !DILexicalBlock(scope: !17, file: !1, line: 118, column: 51)
!142 = !DILocation(line: 121, column: 23, scope: !140)
!143 = !DILocation(line: 124, column: 38, scope: !140)
!144 = !DILocation(line: 124, column: 33, scope: !140)
!145 = !DILocation(line: 125, column: 23, scope: !140)
!146 = !DILocation(line: 126, column: 40, scope: !140)
!147 = !DILocation(line: 126, column: 35, scope: !140)
!148 = !DILocation(line: 127, column: 23, scope: !140)
!149 = !DILocation(line: 128, column: 29, scope: !140)
!150 = !DILocation(line: 128, column: 23, scope: !140)
!151 = !DILocation(line: 130, column: 28, scope: !140)
!152 = !DILocation(line: 130, column: 22, scope: !140)
!153 = !DILocation(line: 135, column: 18, scope: !154)
!154 = distinct !DILexicalBlock(scope: !17, file: !1, line: 135, column: 9)
!155 = !DILocation(line: 135, column: 9, scope: !17)
!156 = !DILocation(line: 135, column: 30, scope: !157)
!157 = !DILexicalBlockFile(scope: !154, file: !1, discriminator: 1)
!158 = !DILocation(line: 135, column: 24, scope: !157)
!159 = !DILocation(line: 109, column: 20, scope: !17)
!160 = !DILocation(line: 137, column: 32, scope: !17)
!161 = !{!162, !162, i64 0}
!162 = !{!"int", !118, i64 0}
!163 = !DILocation(line: 108, column: 20, scope: !17)
!164 = !DILocation(line: 137, column: 19, scope: !17)
!165 = !DILocation(line: 141, column: 9, scope: !46)
!166 = !DILocation(line: 141, column: 9, scope: !17)
!167 = !DILocation(line: 143, column: 23, scope: !168)
!168 = distinct !DILexicalBlock(scope: !45, file: !1, line: 143, column: 13)
!169 = !DILocation(line: 142, column: 13, scope: !45)
!170 = !DILocation(line: 143, column: 57, scope: !168)
!171 = !DILocation(line: 143, column: 13, scope: !45)
!172 = !DILocation(line: 144, column: 21, scope: !173)
!173 = distinct !DILexicalBlock(scope: !168, file: !1, line: 143, column: 64)
!174 = !DILocation(line: 144, column: 13, scope: !173)
!175 = !DILocation(line: 145, column: 13, scope: !173)
!176 = !DIExpression(DW_OP_deref)
!177 = !DILocation(line: 147, column: 9, scope: !45)
